Revit 2024 API
FabricWireItem.WireType Property
 The wire type of this wire item
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017
Syntax
C#
public ElementId WireType { get; set; }
Visual Basic
Public Property WireType As ElementId
	Get
	Set
Visual C++
public:
property ElementId^ WireType {
	ElementId^ get ();
	void set (ElementId^ value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  When setting this property: wireType is not a valid Element identifier.
Autodesk.Revit.Exceptions.ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
FabricWireItem Class
Autodesk.Revit.DB.Structure Namespace